app/controllers/listings_controller.rb

  def show
    listing_id = params[:id]
    @listing = Listing.find_by(id: listing_id)
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    listing_id = params[:id]
    @listing = Listing.find_by(id: listing_id)
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]